In [3]:
import pandas as pd

In [1]:
scores = {
    "name": ['Ray', 'Japhy', 'Zosa'],
    "city": ['San Francisco', 'San Francisco', 'Denver'],
    "score": [75, 92, 94]
}

In [4]:
df = pd.DataFrame(scores)

In [5]:
df

    name           city  score
0    Ray  San Francisco     75
1  Japhy  San Francisco     92
2   Zosa         Denver     94

In [7]:
df['score']

0    75
1    92
2    94
Name: score, dtype: int64

In [9]:
df['name_city'] = df['name'] + '_' + df['city']

In [10]:
df[df['score'] > 90]

    name           city  score            name_city
1  Japhy  San Francisco     92  Japhy_San Francisco
2   Zosa         Denver     94          Zosa_Denver

Pandas Options

In [4]:
emissions = pd.DataFrame({
    "country": ['China', 'United States', 'India'],
    "year": ['2018', '2018', '2018'],
    "co2_emissions": [10060000000.0, 5410000000.0, 2650000000.0]
})
emissions

         country  year  co2_emissions
0          China  2018   1.006000e+10
1  United States  2018   5.410000e+09
2          India  2018   2.650000e+09

In [5]:
pd.set_option('max_rows', 2)
emissions

   country  year  co2_emissions
0    China  2018   1.006000e+10
..     ...   ...            ...
2    India  2018   2.650000e+09

[3 rows x 3 columns]

In [6]:
pd.set_option('max_columns', 2)
emissions

   country  ... co2_emissions
0    China  ...  1.006000e+10
..     ...  ...           ...
2    India  ...  2.650000e+09

[3 rows x 3 columns]

In [7]:
pd.options.display.float_format = '{:,.2f}'.format
emissions

   country  ...     co2_emissions
0    China  ... 10,060,000,000.00
..     ...  ...               ...
2    India  ...  2,650,000,000.00

[3 rows x 3 columns]